Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON LATAM_Dreaming Freedom.tmx
Source language: en
Languages: es_419

source: ...so I know how it feels to be betrayed by someone you thought was your friend.
es_419: POR ESO ENTIENDO QUÉ SE SIENTE CUANDO TE TRAICIONA ALGUIEN A QUIEN CONSIDERABAS TU AMIGA.

source: wow... what a freak.
es_419: VAYA… QUÉ BICHO RARO.

source: ...and I defended you.
es_419: … Y TE DEFENDÍ.

source: I came outside for a second, do you want to come here too?
es_419: SALÍ UN MOMENTO. ¿QUIERES VENIR?

source: I think the teacher will get mad if she sees...
es_419: LA MAESTRA SE ENFADARÁ SI NOS VE…

source: what does she think she’s doing...
es_419: ¿QUÉ SE PIENSA QUE ESTÁ HACIENDO…?

source: I’m going to kill her!!
es_419: ¡VOY A MATARLA!

source: you said that if I wanted to kill them, you’d think about it.
es_419: DIJISTE QUE ME AYUDARÍAS SI YO QUERÍA ASESINARLAS.

source: true, haha.
es_419: TIENES RAZÓN. JA, JA.

source: can you tell me your number?
es_419: ¿ME LO DAS?

source: whether juhyeon cut me off or not, I’d never hang out with a loser like you.
es_419: NUNCA ANDARÍA CON UNA PERDEDORA COMO TÚ, SIN IMPORTAR SI JUHYEON ME DEJÓ DE LADO O NO.

source: I’ll get it!
es_419: ¡YO TE LO TRAIGO!

source: r-really...?
es_419: ¿E-EN SERIO…?

source: I know this isn’t the time to be picky.
es_419: NO ES MOMENTO DE SER QUISQUILLOSA.

source: I’ll never do it again...
es_419: NO VOLVERÉ A HACERLO…

source: she remembered me...
es_419: SE ACUERDA DE MÍ…

source: hahaha.
es_419: JA, JA, JA.

source: are you okay now?
es_419: ¿YA ESTÁS BIEN?

source: can I say hi if I run into you again?
es_419: ¿PUEDO SALUDARTE SI NOS VOLVEMOS A VER?

source: what would your expression look like?
es_419: ¿QUÉ CARA PONDRÍAS?

source: Created by
es_419: Creado por

source: all she’s done is hide behind her friends and laugh at me.
es_419: SOLO SE ESCONDE DETRÁS DE SUS AMIGAS Y SE RÍE DE MÍ.

source: oh, hi, juhyeon!
es_419: ¡AH! ¡HOLA, JUHYEON!

source: serve justice.
es_419: HAZ JUSTICIA.

source: that bitch!!
es_419: ¡ESA PERRA!

source: how long have you been dating?
es_419: ¿HACE CUÁNTO SALEN?

source: the account I saw is the same account as the one you’re logged into.
es_419: LA CUENTA QUE VI ES LA MISMA CON LA QUE INICIASTE SESIÓN.

source: I knew, just like you did.
es_419: YO LO SABÍA, IGUAL QUE TÚ AHORA.

source: let it all out.
es_419: CUÉNTAME TODO.

source: how?! whenever I showed my friends, they didn’t really care!
es_419: ¡¿CÓMO PUEDE SER?! CUANDO LES MOSTRÉ LA PEGATINA A MIS AMIGOS, ¡NO LES INTERESÓ PARA NADA!

source: pfft..
es_419: PFF…

source: I’m going to stop by the nurse’s office.
es_419: YO TENGO QUE IR A LA ENFERMERÍA.

source: I’m someone who can kill others without anyone noticing.
es_419: PUEDO MATAR A OTRAS PERSONAS SIN QUE NADIE LO SEPA.

source: school violence
es_419: VIOLENCIA ESCOLAR

source: what are you talking about...
es_419: ¿DE QUÉ ESTÁS HABLANDO…?

source: my boyfriend said that guy’s a lost cause
es_419: MI NOVIO ME DIJO QUE ESE TIPO ES UN CASO PERDIDO

source: good to see you again...
es_419: QUÉ BUENO VERTE DE NUEVO…

source: I was affected because juhyeon ha twisted the story in her favor.
es_419: LA PASÉ MAL PORQUE JUHYEON CONTÓ LAS COSAS COMO QUISO.

source: wow, today’s school lunch sucked.
es_419: EL ALMUERZO DE HOY FUE HORRIBLE.

source: if you’re so annoyed, why don’t you just crush her like you did to those kids in the old days?
es_419: SI TANTO TE MOLESTA, ¿POR QUÉ NO LA APLASTAS COMO HICISTE CON ESOS CHICOS HACE MUCHO?

source: I just said I’d listen.
es_419: DIJE QUE TE ESCUCHARÍA.

source: is she not mad anymore?
es_419: ¿YA NO ESTÁ ENOJADA?

source: do you like that cartoon?
es_419: ¿TE GUSTA ESA CARICATURA?

source: sit down
es_419: SE SIENTA

source: you should focus on your own!!
es_419: ¡¡MEJOR CONCÉNTRATE EN LA TUYA!!

source: there’s no way juhyeon did that just because she felt sorry for me.
es_419: ES OBVIO QUE JUHYEON NO SE SENTÍA MAL POR CÓMO ME TRATÓ.

source: clatter
es_419: RAAC

source: it’s fun hearing about how your school life is changing.
es_419: ES ENTRETENIDO VER CÓMO CAMBIA TU VIDA EN LA ESCUELA.

source: that’s a crime, you know that? haha...
es_419: ES ILEGAL, ¿SABES? JA, JA…

source: to think that I was so hung up over her...
es_419: Y PENSAR QUE ESTABA TAN OBSESIONADA CON ELLA…

source: are you all right...?
es_419: ¿ESTÁS BIEN…?

source: you’re working with juhyeon and you only approached me to embarrass me, didn’t you?
es_419: ESTÁS CON JUHYEON Y TE ACERCASTE A MÍ PARA BURLARTE, ¿NO?

source: well, I have no choice... keep this a secret, then.
es_419: CREO QUE NO TENGO ALTERNATIVA… GUARDEN EL SECRETO.

source: that was the beginning...
es_419: ESE FUE EL COMIENZO…

source: rummage
es_419: BUSCA

source: is juhyeon not here today?
es_419: ¿AÚN NO LLEGÓ JUHYEON?

source: someone like juhyeon...?
es_419: ¿A ALGUIEN COMO JUHYEON…?

source: it’s not even the start of the school year...
es_419: EL AÑO ESCOLAR ACABA DE EMPEZAR…

source: but the other kids in our class also began picking on me one by one.
es_419: … PERO, POCO A POCO, LOS DEMÁS TAMBIÉN EMPEZARON A DECIRME COSAS.

source: you really did know.
es_419: YA LO SABÍAS.

source: if you hear anything from her, don’t believe it!
es_419: SI TE DICE ALGO, ¡NO LE CREAS!

source: I-I’m fine with waiting... what about you, jeongmin?
es_419: YO PUEDO ESPERAR… ¿Y TÚ, JEONGMIN?

source: can we talk?
es_419: ¿PODEMOS HABLAR?

source: that was only because you two were there to chime in.
es_419: SOLO PORQUE ESTABAN USTEDES TAMBIÉN.

source: of course, I was supposed to help him out because he’s so bad.
es_419: LA IDEA ERA QUE YO LO AYUDARA PORQUE ÉL JUEGA MUY MAL.

source: why, what’s happening?
es_419: POR QUÉ LO DICES? QUÉ SUCEDE?

source: they were talking about you,
es_419: HABLABAN DE TI.

source: I bet you got so much love from your parents growing up.
es_419: APUESTO A QUE TE DIERON MUCHO AMOR CUANDO CRECÍAS.

source: maybe they thought my story was fun.
es_419: QUIZÁS PENSARON QUE MI HISTORIA ERA ENTRETENIDA.

source: you can text us, right?
es_419: MÁNDANOS UN MENSAJE, ¿SÍ?

source: who confessed first?
es_419: ¿QUIÉN SE CONFESÓ PRIMERO?

source: whatever!
es_419: ¡OLVÍDALO!

source: I’m a victim of hers, too.
es_419: YO TAMBIÉN SOY UNA DE SUS VÍCTIMAS.

source: and also, her family is--
es_419: ADEMÁS, SU FAMILIA ES…

source: anyways, I’m relieved.
es_419: QUÉ ALIVIO.

source: all of you say you want to kill me just from looking at my face.
es_419: USTEDES SIEMPRE DICEN QUE SOLO DE VERME LES DAN GANAS DE MATARME…

source: is it that impressive to know people’s names?
es_419: ¿TAN IMPRESIONANTE ES ACORDARSE EL NOMBRE DE TODOS?

source: I guess that’s only natural since I haven’t really seen their faces or heard their names before?
es_419: SUPONGO QUE ES NORMAL; QUIZÁ SE DEBA A QUE NUNCA LAS VI BIEN Y A QUE TAMPOCO SÉ SUS NOMBRES.

source: everyone’s waiting at the front gate!
es_419: ¡ESTÁN TODOS ESPERANDO EN LA PUERTA!

source: I don’t know where to start, but...
es_419: NO SÉ POR DÓNDE EMPEZAR, PERO…

source: why are you hanging out with someone like jeongmin?
es_419: ¿POR QUÉ TE JUNTAS CON ALGUIEN COMO JEONGMIN?

source: no, we’ve been playing around too much lately, so we’re going to study at home.
es_419: NO, YA SALIMOS MUCHO ÚLTIMAMENTE, ASÍ QUE AHORA VAMOS A CASA A ESTUDIAR.

source: Why are these b*tches alive?
es_419: ¿POR QUÉ ESTAS P*TAS ESTÁN VIVAS?

source: when did you get here?
es_419: ¿CUÁNDO LLEGASTE?

source: I knew she was imagining things.
es_419: SABÍA QUE ERAN INVENTOS DE ELLA.

source: that sticker I picked up.
es_419: ESA PEGATINA QUE ENCONTRÉ.

source: now I have to see if the passcode he told me yesterday is right.
es_419: AHORA TENGO QUE VER SI LA CONTRASEÑA ES CORRECTA.

source: really? then I’ll only tell you.
es_419: ¿EN SERIO? SOLO TE LO DIRÉ A TI.

source: her expression that day...
es_419: LA CARA QUE PUSO AQUEL DÍA…

source: ...dead...?
es_419: MUERTO…?

source: I’ll wait in front of the front gate.
es_419: TE ESPERO EN LA PUERTA DEL FRENTE.

source: ...but that’s to be expected.
es_419: … AUNQUE NO HAY NADA RARO CON ESO.

source: ...but when would I ever get revenge on her if not now?
es_419: … SI NO APROVECHO ESTA OPORTUNIDAD PARA VENGARME, ¿CUÁNDO PODRÉ HACERLO?

source: d-do you want to go to the snack shop?
es_419: ¿QUIERES IR A COMPRAR ALGO DE COMER…?

source: what are they whispering about?
es_419: ¿QUÉ ESTÁN SUSURRANDO?

source: do you want people to call you gross and creepy?
es_419: ¿QUIERES QUE TODOS TE LLAMEN RATITA ASQUEROSA?

source: just let it go. you know she’s always like this.
es_419: NO TE PREOCUPES. SABES QUE SIEMPRE ES ASÍ…

source: j-juhyeon, I...
es_419: JUHYEON, YO…

source: ah... right...
es_419: AH, CIERTO…

source: but if I stop talking now...
es_419: PERO SI NO DIGO NADA MÁS…

source: rise
es_419: SE LEVANTA

source: I’ll pay, so let’s eat together...!
es_419: YO INVITO. ¡COMAMOS JUNTAS…!

source: I’ll just have an americano...
es_419: VOY A PEDIR UN AMERICANO…

source: thank you...
es_419: GRACIAS…

source: ...before I take any questions, I think you should know what it is that I can do.
es_419: … ANTES DE QUE ME PREGUNTES, DEBERÍAS SABER LO QUE SOY CAPAZ DE HACER.

source: it’s the only way I can relieve my stress...
es_419: SOLO ASÍ PUEDO LIBERAR EL ESTRÉS QUE TENGO…

source: attention! salute the teacher!
es_419: ¡ATENCIÓN! ¡SALUDEN AL PROFESOR!

source: hmm... not exactly.
es_419: MMM… NO REALMENTE.

source: jeongmin said he walks home from school this way...
es_419: JEONGMIN DIJO QUE VUELVE DE LA ESCUELA POR AQUÍ.

source: 글, 그림 2L 밑색 도움 kk
es_419: ARTE/HISTORIA DE 2L AYUDA CON EL COLOR KK

source: aw, that sucks.
es_419: UF, QUÉ MAL.

source: as long as this guy continues to be by my side, I have nothing to be afraid of anymore.
es_419: MIENTRAS ÉL ESTÉ DE MI LADO, NO TENGO NADA QUE TEMER.

source: in the end, I took the fall for all of it.
es_419: AL FINAL, TODA LA CULPA RECAYÓ EN MÍ.

source: don’t appear in my dreams, either.
es_419: TAMPOCO APAREZCAS EN MIS SUEÑOS.

source: fine then...
es_419: ESTÁ BIEN…

source: did I do something wrong...?
es_419: ¿HICE ALGO MALO…?

source: all you know how to do is try to teach other people lessons,
es_419: TE PASAS TODO EL DÍA SERMONEANDO A LOS DEMÁS.

source: didn’t you hear me?! come here!!
es_419: ¡¿NO ME OYES?! ¡VEN AQUÍ!

source: Jeongmin choi thinks she’s all that and everyone in class who likes her is exactly the same. jeongmin and her 32 morons
es_419: JEONGMIN CHOI SE CREE LA GRAN COSA Y TODOS LOS QUE LA ADORAN SON IGUALES. JEONGMIN Y SUS 32 IDIOTAS…

source: unlike a certain someone...
es_419: A DIFERENCIA DE ALGUIEN…

source: lucid dreaming
es_419: SUEÑOS LÚCIDOS

source: you can talk to me casually too, jeongmin.
es_419: TÚ TAMBIÉN PUEDES HABLARME CON CONFIANZA, JEONGMIN.

source: okay, promise?
es_419: ¿LO PROMETES?

source: I barely made it before the bell...
es_419: LLEGUÉ JUSTO ANTES DE LA CAMPANA…

source: what’s going on...?
es_419: ¿QUÉ SUCEDE…?

source: my first impression of juhyeon...
es_419: MI PRIMERA IMPRESIÓN DE JUHYEON…

source: I was surprised that you asked to see me today.
es_419: ME SORPRENDIÓ QUE ME PIDIERAS VERNOS HOY.

source: what’s she unhappy about this time...?
es_419: ¿POR QUÉ ESTÁ TAN MOLESTA AHORA…?

source: I’m saving my data because I don’t have that much...!
es_419: ¡NO USO DATOS PORQUE TENGO POCOS…!

source: eunju is waiting.
es_419: EUNJU NOS ESTÁ ESPERANDO.

source: h-he’s so close...
es_419: ESTÁ… MUY CERCA…

source: hyejin, when are you coming?
es_419: ¿VIENES, HYEJIN?

source: how could I not show her something that funny--
es_419: NO PUDE EVITAR MOSTRARLE ALGO TAN CHISTOSO COMO ESO…

source: what did you ever do?!
es_419: ¡¿Y TÚ QUÉ HICISTE?!

source: fine, then.
es_419: ESTÁ BIEN.

source: I said, I’m not going.
es_419: DIJE QUE NO IRÉ.

source: all of us think the same way...
es_419: TODAS PENSAMOS IGUAL…

source: didn’t juhyeon cut you off?
es_419: JUHYEON TE DEJÓ DE LADO, ¿NO?

source: grit
es_419: RABIA

source: have you ever thought about why people avoid you?
es_419: ¿ALGUNA VEZ PENSASTE POR QUÉ LA GENTE NO TE QUIERE NI VER?

source: let’s get revenge on her together. even if it’s not revenge...
es_419: VAMOS A VENGARNOS DE ELLA. INCLUSO SI NO NOS VENGAMOS,

source: I’m sorry, but... what are your names again...?
es_419: PERDÓN, PERO… ¿ME RECUERDAN SUS NOMBRES…?

source: My favorite things are lying in bed watching Youtube and looking at social media posts.
es_419: Lo que más me gusta es acostarme en la cama a mirar YouTube y redes sociales.

source: I read those comics to see if they were really plagiarized or not,
es_419: LEÍ LOS CÓMICS PARA VER SI EN REALIDAD ERA UN PLAGIO,

source: who would want to be mean outright?
es_419: NADIE QUIERE SER MALA PERSONA ASÍ COMO ASÍ.

source: oh... her...
es_419: AH… ELLA…

source: juhyeon keeps telling me not to hang out with you.
es_419: JUHYEON QUIERE QUE NO ME JUNTE MÁS CON USTEDES.

source: it’s nothing. just don’t act like sora and be careful from now on.
es_419: NADA. SIMPLEMENTE NO HAGAS LO MISMO QUE SORA Y TEN CUIDADO.

source: if that’s what you want.
es_419: SI ESO ES LO QUE QUIERES.

source: ah, yeah.
es_419: AH, SÍ.

source: when are you going to grow up?
es_419: ¿CUÁNDO VAS A MADURAR?

source: hey, eunju, let’s just go.
es_419: VÁMONOS, EUNJU.

source: y-yeah?
es_419: ¿SÍ…?

source: we were the only ones in that group chat.
es_419: SOLO NOSOTRAS ESTAMOS EN ESE GRUPO.

source: wow... even the title is a knock-off...
es_419: VAYA… INCLUSO EL NOMBRE ES UNA COPIA…

source: I gave juhyeon a taste of her own medicine...
es_419: HICE QUE JUHYEON PRUEBE UN POCO DE SU PROPIA MEDICINA…

source: i wish JH and HK and EJ would just
es_419: OJALÁ JH Y HK Y EJ

source: I’m glad we were dismissed 5 minutes early today!
es_419: ¡QUÉ BUENO QUE NOS HAYAN DEJADO SALIR CINCO MINUTOS ANTES HOY!

source: what about the other chat rooms...?
es_419: ¿QUÉ HAY DE LAS OTRAS SALAS…?

source: you don’t have any friends to chat with anyways, haha.
es_419: DE TODOS MODOS, NO TIENES AMIGAS CON QUIENES HABLAR. JA, JA.

source: our school’s gym uniforms don’t have pockets...
es_419: LOS UNIFORMES DE GIMNASIA NO TIENEN BOLSILLOS…

source: ...but it was a man with white hair.
es_419: … PERO ERA UN HOMBRE DE CABELLO BLANCO.

source: I want to help you.
es_419: QUIERO AYUDARTE.

source: I assigned homework yesterday, didn’t I?
es_419: LES DI TAREA AYER, ¿NO?

source: she just called me and eunju over one day,
es_419: UN DÍA NOS LLAMÓ A EUNJU Y A MÍ,

source: you’re more than capable of that!!
es_419: ¡ERES PERFECTAMENTE CAPAZ DE HACER ESO!

source: it’s not them!
es_419: ¡ELLAS NO!

source: maybe it’s because I released some stress...
es_419: TAL VEZ SEA PORQUE LIBERÉ UN POCO DE ESTRÉS…

source: ugh, it was so hard to get these
es_419: UFF, ME COSTÓ MUCHO CONSEGUIRLOS

source: thank you!
es_419: ¡GRACIAS!

source: nudge
es_419: EMPUJA

source: who was he?
es_419: ¿QUIÉN ERA?

source: what kind of dream?
es_419: ¿QUÉ CLASE DE SUEÑO?

source: what are you talking about?
es_419: ¿A QUÉ TE REFIERES?

source: as the days went by, she began to show me her true colors.
es_419: A MEDIDA QUE PASARON LOS DÍAS, EMPEZÓ A MOSTRAR SU VERDADERA CARA.

source: I just have to hang out with her in school.
es_419: SOLO TENGO QUE PASAR TIEMPO CON ELLA EN LA ESCUELA.

source: now, there was no one who bothered me directly...
es_419: YA NADIE ME MOLESTABA DIRECTAMENTE…

source: no, it’s all right.
es_419: NO, ESTÁ BIEN.

source: ...but don’t talk about juhyeon like that.
es_419: … PERO NO HABLES ASÍ DE JUHYEON.

source: I have fun gossiping about other people...
es_419: ME DIVIERTE CHISMOSEAR SOBRE OTRAS PERSONAS…

source: it’s working...
es_419: FUNCIONA…

source: if you don’t fix that habit of borrowing money from everyone, you’re going to have a hard time in the real world, you know that?
es_419: SI NO CORRIGES ESE HÁBITO DE PEDIRLE DINERO A LOS DEMÁS, TENDRÁS PROBLEMAS EN EL MUNDO REAL, ¿ENTIENDES?

source: why do I have to be treated like this...?
es_419: ¿POR QUÉ ME TRATAN ASÍ…?

source: when I ran out of things to bash juhyeon about, I tried to start other conversations...
es_419: CUANDO SE ME ACABARON LOS CHISMES SOBRE JUHYEON, INTENTÉ HABLAR DE OTRAS COSAS…

source: is he your boyfriend?
es_419: ¿ES TU NOVIO?

source: my homeroom teacher will be more upset if I’m late because I had to wash up...
es_419: PERO EL PROFESOR SE ENFADARÁ MUCHO MÁS SI ME LAVO LA CABEZA Y LLEGO TARDE POR ESO…

source: something’s weird...
es_419: ALGO SUCEDE…

source: ...but after hearing what you said today, I finally get it.
es_419: PERO, DESPUÉS DE LO QUE DIJISTE HOY, AL FIN LO ENTIENDO.

source: nervous
es_419: NERVIOSA

source: yuju complained about it a few times to my friend.
es_419: YUJU SE QUEJÓ DE ESO CON MI AMIGA UN PAR DE VECES.

source: of course.
es_419: CLARO.

source: ah, jeongmin! are you headed to school now?
es_419: ¡JEONGMIN! ¿VAS DE CAMINO A LA ESCUELA?

source: sora, let’s talk for a second.
es_419: SORA, QUIERO HABLAR CONTIGO.

source: and I can astral project and look around the world like a ghost.
es_419: Y HACER UNA PROYECCIÓN ASTRAL PARA DEAMBULAR POR EL MUNDO COMO UN FANTASMA.

source: well, it was a few days ago, so I don’t really remember...
es_419: YA PASARON UNOS DÍAS, ASÍ QUE NO LO RECUERDO BIEN…

source: do you need something?
es_419: ¿NECESITAS ALGO?

source: poke
es_419: TOCA

source: jeongmin is even worse than I thought!
es_419: ¡JEONGMIN ES PEOR DE LO QUE IMAGINÉ!

source: leave it to me!
es_419: ¡CONFÍA EN MÍ!

source: right...
es_419: SÍ…

source: notes reminders stocks imoovie
es_419: NOTAS RECORDATORIOS ACCIONES IMOOVIE

source: what was that just now?
es_419: ¿QUÉ FUE ESO?

source: lucid dreaming...?
es_419: ¿SUEÑOS LÚCIDOS…?

source: snatch
es_419: ARREBATA

source: I asked you to hang out with jeongmin, so why are you all alone?
es_419: LES PEDÍ QUE SE JUNTARAN CON JEONGMIN. ¿POR QUÉ ESTÁS SOLA?

source: ...would I be able to enjoy this moment with everyone now?
es_419: … ¿PODRÍA DISFRUTAR AHORA ESTE MOMENTO CON TODAS LAS DEMÁS?

source: ...might not be me...
es_419: … SON ELLAS…

source: I’m sure you’ll prefer having no one else around.
es_419: ESTOY SEGURA DE QUE ESO ES LO QUE MÁS TE CONVIENE.

source: no, I don’t remember saying that--
es_419: NO RECUERDO HABER DICHO ESO…

source: it’s karma.
es_419: ES KARMA.

source: you’re hanging out...? together?
es_419: ¿VAN A SALIR…? ¿JUNTAS?

source: do you actually believe what she said at the cafe?
es_419: ¿REALMENTE CREES TODAS LAS MENTIRAS QUE DIJO EN LA CAFETERÍA?

source: sora told me she was on my side.
es_419: SORA DIJO QUE ESTÁ DE MI LADO.

source: ...but I can’t trust him.
es_419: … PERO NO PUEDO CONFIAR EN ÉL.

source: looking around
es_419: MIRA ALREDEDOR

source: fling
es_419: SORPRESA

source: I wasn’t trying to hide it on purpose!
es_419: ¡NO QUISE OCULTÁRTELO A PROPÓSITO!

source: did they switch seats permanently?
es_419: ¿CAMBIARON DE LUGARES?

source: I know all of them too.
es_419: YO TAMBIÉN LOS RECUERDO…

source: I never asked you that.
es_419: NO TE PREGUNTÉ ESO.

source: all I need is you, jaehyeok.
es_419: SOLO TE NECESITO A TI, JAEHYEOK.

source: but you two got over it in no time!
es_419: ¡PERO HICIERON LAS PACES ENSEGUIDA!

source: all right, what is it?
es_419: ¿QUÉ NECESITAS?

source: a present for you
es_419: UN REGALO PARA TI

source: die.
es_419: MUERE.

source: don't fucking look at me like that!
es_419: ¡NO ME MIRES ASÍ, IDIOTA!

source: the one who controls juhyeon in my dreams is me.
es_419: YO SOY LA QUE CONTROLA A JUHYEON EN MIS SUEÑOS.

source: don’t play with jeongmin anymore!
es_419: ¡YA NO JUEGUES CON JEONGMIN!

source: I wish that fucking bitch jeongmin choi would die. aren’t her sidekicks tired of sucking up to her?
es_419: OJALÁ ESA PERRA DE JEONGMIN CHOI SE MUERA. ¿TODAVÍA NO SE CANSARON DE ELLA SUS AMIGUITAS SECUACES?

source: if I...
es_419: SI…

source: what leagues are there between friends?
es_419: ¿QUÉ NIVELES EXISTEN ENTRE LOS AMIGOS?

source: shatter
es_419: CRASH

source: who else would say this kind of stuff about anyone in our class other than you?
es_419: ¿QUIÉN MÁS DIRÍA ESTAS COSAS SOBRE NUESTRAS COMPAÑERAS, ADEMÁS DE TI?

source: you just didn’t want to see me act up!
es_419: ¡SOLO NO QUERÍAS VERME ENOJADA!

source: if she humiliates me right next to jaehyeok...
es_419: SI ME HUMILLA FRENTE A JAEHYEOK…

source: this is my dream!
es_419: ¡ESTE ES MI SUEÑO!

source: I have chills...
es_419: QUÉ MIEDO…

source: sora, what are you saying--
es_419: ¿QUÉ DICES, SORA…?

source: I didn’t know that you two were thinking of me...
es_419: NO SABÍA QUE ESTABAN PREOCUPADAS POR MÍ…

source: wtf hahaha
es_419: WTF JAJAJA

source: hug
es_419: ABRAZA

source: let me know if you do!
es_419: SI LO HACES, ¡AVÍSAME!

source: I knew you were using me to mess with jeongmin because of your precious reputation,
es_419: SÉ QUE ME USABAS PARA VENGARTE DE JEONGMIN Y CUIDAR TU PRECIOSA REPUTACIÓN,

source: lucid dreams are the very basics.
es_419: LOS SUEÑOS LÚCIDOS SON LO MÁS BÁSICO.

source: the person in front of me dropped this...
es_419: A LA PERSONA QUE VA DELANTE SE LE CAYÓ ESTO…

source: ...his reaction will only be more sensitive...
es_419: SU REACCIÓN SERÁ PEOR.

source: I hope nothing happens today...
es_419: ESPERO QUE HOY NO PASE NADA…

source: ...and there’s no end to how arrogant I can get.
es_419: … Y PUEDO SER ALGUIEN MUY ARROGANTE.

source: you’re what?
es_419: ¿TÚ QUÉ?

source: yes?
es_419: ¿SÍ?

source: all of a sudden...?
es_419: ¿POR QUÉ TAN REPENTINO…?

source: where’s this coming from?
es_419: ¿DE QUÉ HABLAS?

source: I owe you money, anyway.
es_419: DESPUÉS DE TODO, TE DEBO DINERO.

source: I’m sorry, jeongmin...!
es_419: ¡LO SIENTO, JEONGMIN!

source: you would’ve gotten in trouble for bullying if it wasn’t for juhyeon, haha.
es_419: SI NO FUERA POR JUHYEON, HABRÍAS TENIDO PROBLEMAS POR HACER BULLYING, JA, JA.

source: you didn’t even notice I was here
es_419: NI SIQUIERA TE DISTE CUENTA DE QUE ESTOY AQUÍ.

source: it was kind of a surprise.
es_419: FUE UNA SORPRESA.

source: you two go ahead first.
es_419: VAYAN USTEDES.

source: I’m screwed...
es_419: QUÉ DESASTRE…

source: w-what’s wrong?
es_419: ¿Q-QUÉ SUCEDE?

source: ...juhyeon lost consciousness and started bleeding in the middle of the night...
es_419: … JUHYEON SE DESMAYÓ Y COMENZÓ A SANGRAR DURANTE LA NOCHE…

source: it’s just that you won’t know what’s going on...
es_419: ES QUE TE SENTIRÁS COMO SAPO DE OTRO POZO…

source: ...juhyeon began avoiding me...
es_419: JUHYEON COMENZÓ A EVITARME…

source: okay, let’s go.
es_419: VAMOS.

source: she must be used to getting cussed out now, haha.
es_419: YA DEBE ESTAR ACOSTUMBRADA A QUE LE HABLEMOS ASÍ. JA, JA.

source: that’s my number! save it!
es_419: ¡ESE ES EL MÍO! ¡GUÁRDALO!

source: I knew it...!
es_419: ¡LO SABÍA…!

source: if I did, I’m sorry...
es_419: SI ES ASÍ, LO SIENTO…

source: what if I argue back?
es_419: ¿Y SI LES DIGO ALGO?

source: everything feels so realistic...
es_419: ES TODO TAN REAL…

source: pretending to be righteous... it’s disgusting.
es_419: PRETENDES SER UNA PERSONA BUENA… ¡ME DAS ASCO!

source: I went outside with sora because I had something to talk to her about.
es_419: SALÍ CON SORA PORQUE QUERÍA HABLAR CON ELLA SOBRE UN TEMA.

source: I was worried you wouldn’t understand.
es_419: ME PREOCUPABA QUE NO LO ENTENDIERAS…

source: so--
es_419: ASÍ QUE…

source: here.
es_419: TOMA.

source: just play along until we find out what her secret is.
es_419: SIGÁMOSLE LA CORRIENTE HASTA QUE DESCUBRAMOS SU SECRETO.

source: why are you acting like this...?
es_419: ¿POR QUÉ TE COMPORTAS ASÍ…?

source: Hello, I am 2L, a creator of "Dreaming Freedom."
es_419: Hola, soy 2L, la persona encargada de crear "Dreaming Freedom".

source: whoa.
es_419: VAYA.
